{"pages":[{"text":"About PyData Munich We are a small group that meets every two weeks in Munich...","title":"About","tags":"pages","url":"pages/about.html"},{"text":"Our Munich Support Network We've been hosted by and sponsored by a number of generous groups around Munich, and the number is still growing!","title":"Map","tags":"pages","url":"pages/map.html"},{"text":"Speaker: Giacomo Debidda PyData and Super Python Talks are back with another accessible data science tutorial, this time by Giacomo Debidda and at the LMU Biozentrum in Planegg! HDF5 is a file format and a data model designed to store large amounts of data used by many top universities, agencies, and research institutes. Let's get familiar with this file format. In this talk, we will learn how to create, manipulate and perform superfast, in-kernel queries on big HDF5 data files with Python's \"h5py\", \"PyTables\", and \"numexpr\" packages. Join us! Schedule: 6:30pm: Doors Open 7pm: Lighting Talk: TBA 7:20pm: Tutorial by Giacomo Debidda: High Performance Data Analysis with Big HDF5 Files in Python 8:15pm-9pm: Job Advertisements and Networking with Beer and Pizza Many thanks to our sponsor for this event: TNG Consulting (https://www.tngtech.com/en.html)! If you are interested in giving a talk or organizing an event, please email one of the organizers (including myself: [masked]) and let me know! If you are looking for inspiration for a talk topic or want to request one, please check out the ever-growing lists of topics here: https://docs.google.com/document/d/1wrdv27B7UGRJelbk8EQdHmBZ8uuO0I4q2JlJrsiCGlI/edit?usp=sharing See you there! -Nick Total Attendees: 19 Event Link: https://www.meetup.com/SuperPythonTalks/events/245641511/","title":"Tutorial: \"High Performance Data Analysis with Big HDF5 Files in Python\"","tags":"general","url":"high_performance_data_analysis_with_big_hdf5_files_in_python.html"},{"text":"PyData and Super Python Talks are back with another accessible data science tutorial, this time by Parastou Kohvaei and at the JetBrains Event Space! Today, we'll be reviewing one of Python's most powerful machine learning packages, Scikit-Learn. During this introductory-level tutorial, we'll learn how to use this package to perform data clustering and pattern recognition. Join us! Schedule: 6:30pm: Doors Open 7pm: Lighting Talk: TBA 7:20pm: Tutorial by Parastou Kohvaei: Machine Learning with Python: Clustering with Scikit-Learn 8:15pm-9pm: Job Advertisements and Networking with Beer and Pizza Many thanks to our sponsors for this event: JetBrains (https://www.jetbrains.com) and TNG Consulting (https://www.tngtech.com/en.html)! If you are interested in giving a talk or organizing an event, please email one of the organizers (including myself: [masked]) and let me know! If you are looking for inspiration for a talk topic or want to request one, please check out the ever-growing lists of topics here: https://docs.google.com/document/d/1wrdv27B7UGRJelbk8EQdHmBZ8uuO0I4q2JlJrsiCGlI/edit?usp=sharing See you there! -Nick Total Attendees: 59 Event Link: https://www.meetup.com/SuperPythonTalks/events/244895081/","title":"Tutorial: \"Machine Learning with Python: Clustering with Scikit-Learn\"","tags":"general","url":"machine_learning_with_python.html"},{"text":"PyData and Super Python Talks are back with another accessible data science tutorial! There is a lot of data out there on the internet, but it's not always in an easy-to-consume format. Luckily, there are a lot of \"web scraping\" tools out there to help us! These tools take the data and put it into a more structured format, like CSV or Excel. In this talk, Nithish Raghunandanan will show us how to use Scrapy and BeautifulSoup, two powerful web scraping packages for Python, to grab and collect customer contact information from yellow pages web sites! Schedule: 6:30pm: Doors Open 7pm: Lighting Talk: Data Science at TNG Consulting 7:15pm: Tutorial by Nithish Raghunandanan: Scraping Data from the Web with Python using Scrapy and BeautifulSoup 8:15pm-9pm: Job Advertisements and Networking with Beer and Pizza Many thanks to our sponsors for this event: Burda Bootcamp (http://burdabootcamp.de/) and TNG Consulting (https://www.tngtech.com/en.html)! If you are interested in giving a talk or organizing an event, please email one of the organizers (including myself: [masked]) and let me know! If you are looking for inspiration for a talk topic or want to request one, please check out the ever-growing lists of topics here: https://docs.google.com/document/d/1wrdv27B7UGRJelbk8EQdHmBZ8uuO0I4q2JlJrsiCGlI/edit?usp=sharing See you there! -Nick Total Attendees: 12 Event Link: https://www.meetup.com/SuperPythonTalks/events/244750566/","title":"Tutorial: Scraping Data from the Web with Python using Scrapy and BeautifulSoup","tags":"general","url":"scraping_data_from_the_web_with_python_using_scrapy_and_beautifulsoup.html"},{"text":"PyData and Super Python Talks are back online! To kick off the new semester, we'll be reviewing DataFrames with Pandas and showing how using long-format tables can simplify complex data filtering and grouping operations, which we'll demonstrate to make elegant data visualization and statistics code with the Seaborn and Statsmodels packages! Schedule 6:30pm: Doors Open 7pm: Lighting Talk: \"Introduction to PyData and SuperPythonTalks\" 7:15pm: Hands-On Tutorial by Nick Del Grosso: \"Tidy\" Data with Pandas, Seaborn, and Statsmodels 8pm-9pm: Job Advertisements and Networking with Beer and Pizza Many thanks to our sponsors for this event: Burda Bootcamp (http://burdabootcamp.de/) and TNG Consulting (https://www.tngtech.com/en.html)! If you are interested in giving a talk or organizing an event, please email one of the organizers (including myself: [masked]) and let me know! If you are looking for inspiration for a talk topic or want to request one, please check out the ever-growing lists of topics here: https://docs.google.com/document/d/1wrdv27B7UGRJelbk8EQdHmBZ8uuO0I4q2JlJrsiCGlI/edit?usp=sharing See you there! -Nick Total Attendees: 12 Event Link: https://www.meetup.com/SuperPythonTalks/events/244244519/","title":"\"Tidy\" Python DataFrames with Pandas, Seaborn, and Statsmodels","tags":"general","url":"event11.html"},{"text":"Speaker: Andreas Kist Talk Description: Numpy is more than just an elaborate math library; data can be structured and analyzed faster, easier and with greater flexibility. In this lecture, we will cover advantages and disadvantages of numpy, when you should use it, and how to utilize the library on your datasets. Total Attendees: 16 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848865/","title":"Talk: \"Vectorize your Code: Advanced Numpy\"","tags":"general","url":"vectorize_your_code.html"},{"text":"Speaker: Michael Volkmore Python is a powerful \"glue\" language for controlling external programs from the command line and a potent(ial) substitute as well complement to UNIX shell scripts. I will talk about calling command line programs using the subprocess module, working with stdin/stdout, the file system and explain Python command line argument parsing. In addition I will provide examples for automating otherwise interactive tasks as retrieving web pages, reading/writing configuration files, sending/receiving email or scripting ssh connections using the Python standard lib and some extra modules. Total Attendees: 11 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848856/","title":"Talk: \"Batch Processing and Command-Line Interfaces\"","tags":"general","url":"batch_processing_and_command-line_interfaces.html"},{"text":"This talk, given by Nick Del Grosso, will review object-oriented programming (OOP) in Python and will explore how understanding Python's internal object model helps us to understand other intermediate features of the language, including generator functions and context managers. Topics include: Introduction to OOP Python's Magic Methods Staying OOP: Properties vs Attributes What Operators really do in Python What Functions really are in Python What Dictiories are Really Doing in Python How the 'if' statement Really Works in Python How 'for' loops Reall Work in Python Introduction to Generator Functions Introduction to Context Managers Sorry for the last-minute change from the previous topic--I hope everyone will find this talk interesting, and I look forward to seeing you there! Total Attendees: 13 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848841/","title":"Talk: \"Python: Everything is an Object\"","tags":"general","url":"python.html"},{"text":"As our little community grows and needs more and more infrastructure, I though a centralized web site (written with Python, of course) might make for a nice info spot for new members, organizers, and sponsors. My hope is that this site will be useful for advertising and summarizing events, as well as providing links to the various media (github repositories, jupyter notebooks, videos, web links, etc) that are being produced throughout our events. Keep an eye on this page for new news, and subscribe to our various pages for announcements on new tutorials coming up! Anyway, it's been a fun project, and I've learned a lot about Pelican, a Python static web generators by building this site. Looking forward to the future--see you at our next event! Best wishes, Nick","title":"Welcome to PyData Munich!","tags":"general","url":"firstpost.html"},{"text":"Speaker: Roman Prytuliak The talk will consist of introduction into parallel programming with simple application examples in Python. After the talk, the participants will be able to practice the coding, while getting assistance from the tutor(s) and other participants. The topics covered: Understanding the concurrency Race conditions and how to avoid them Basics of the cluster architecture Concept of MPI programming Python modules: threading, multiprocessing, mpi4py Total Attendees: 12 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848824/","title":"Talk: \"Parallelize with Multiprocessing and Cluster Computing\"","tags":"general","url":"parallelize_with_multiprocessing_and_cluster_computing.html"},{"text":"Speaker: Vilim Stih The topic of the talk will be good practices in information design for scientific figures, and how to implement them with standard Python tools. I will cover more advanced methods of visualising 1, 2 and 3-dimesional data using matplotlib (with an emphasis on the object-oriented interface) and seaborn, as well as interactivity with ipywidgets and pyqtgraph. Total Attendees: 15 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848809/","title":"Talk: \"Data Visualization Principles and Their Implementation in Python\"","tags":"general","url":"data_visualization_principles_and_their_implementation_in_python.html"},{"text":"Speaker: Martin Spacek Total Attendees: 12 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848790/","title":"Talk: \"Accelerate Your Code with Cython\"","tags":"general","url":"accelerate_your_code_with_cython.html"},{"text":"Speaker: Achilleas Koutsou Come level up your Python skills! In this session, we will teach you the little things (and maybe some big things) that will increase your productivity when coding with Python. Are you a new Python user that wants to learn what nice tricks the language has to offer? Perhaps you're a Python user that just wants to better understand what the language is doing for you and what more it can offer. Or maybe you're a programmer skilled in other languages that wants to learn why some of us love Python. We'll help you better understand the parts of Python you probably already know, or introduce you to some aspects of the language you weren't aware of. Total Attendees: 13 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848778/","title":"Talk: \"Intermediate-Level Python Programming\"","tags":"general","url":"intermediate-level_python_programming.html"},{"text":"Speaker: Joseph Donovan In this 90-minute hands-on session, Joseph will introduce Scikit-Image to us and show us how it can be used to do some image analysis. Come join us! It's reccomended to bring your own laptop (with Python and Scikit-Image installed) to the session, but we'll bring some extra laptops in case people forget. Total Attendees: 16 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848765/","title":"Talk: \"Image Analysis with Scikit-Image\"","tags":"general","url":"image_analysis_with_scikit-image.html"},{"text":"As your coding project grows, saving your work and keeping track of all the changes that you've made becomes more and more important. Git is a popular versional control system that works with all programming languages, used for saving changes to your code, making backups of your code, and collaborating with others! In this 90-minute workshop, led by Dr. Joseph Donovan, we'll learn the basics of Git in a fun, hands-on group setting. Bringing your own laptops with Git installed (https://git-scm.com/download) is reccommended, but additionally laptops will be provided for anyone that forgets. So join us! (Oh, and this time there's beer!) Total Attendees: 13 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848757/","title":"Workshop: \"Version Control with Git\"","tags":"general","url":"version_control_with_git.html"},{"text":"Speaker: Nicholas A. Del Grosso Total Attendees: 17 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848739/","title":"Talk: \"Databases and SQL with Pandas\"","tags":"general","url":"databases_and_sql_with_pandas.html"},{"text":"Speaker: Ajayrama Kumaraswamy 10 min: Introduction and overview 10 min: Introduction to Ipython notebook 30 min: Statistics with scipy.stats 10 min: Review 30min: Practice session with Ipython notebook Topics: 1. Random Variables and Distribution functions i. Plotting Distribution Functions ii. Custom Random variables and drawing samples 2. Analyzing One Sample i. Basic statistics, histogram ii. Kernel Density Estimation and Distribution Fitting iii. Significance Tests: t-test and Kolmogorov-Smirnov test 3. Analyzing two samples iii. Significance tests Total Attendees: 12 Event Link: https://www.meetup.com/SuperPythonTalks/events/237848686/","title":"Talk: \"Statistical Analysis and Modeling with Scipy-Stats\"","tags":"general","url":"statistical_analysis_and_modeling_with_scipy-stats.html"}]}